<template>
  <div class="test">
    <vue-custom-scrollbar class="scrollComment" :settings="settings">
      <div class="scrollContent">
        每次失望一次，我就少做一件爱你的事，直到最后备注改成全名、取消特别关注、上线不主动找你、收起你送的东西、删掉你所有的照片、再也不偷偷看你的时候，就是该说再见的时候了。多年后你会不会记得，曾经有一个人很努力的珍惜过你。——失望是一天天积累的，离开是很长的决定…
        每次失望一次，我就少做一件爱你的事，直到最后备注改成全名、取消特别关注、上线不主动找你、收起你送的东西、删掉你所有的照片、再也不偷偷看你的时候，就是该说再见的时候了。多年后你会不会记得，曾经有一个人很努力的珍惜过你。——失望是一天天积累的，离开是很长的决定…
        每次失望一次，我就少做一件爱你的事，直到最后备注改成全名、取消特别关注、上线不主动找你、收起你送的东西、删掉你所有的照片、再也不偷偷看你的时候，就是该说再见的时候了。多年后你会不会记得，曾经有一个人很努力的珍惜过你。——失望是一天天积累的，离开是很长的决定…
        每次失望一次，我就少做一件爱你的事，直到最后备注改成全名、取消特别关注、上线不主动找你、收起你送的东西、删掉你所有的照片、再也不偷偷看你的时候，就是该说再见的时候了。多年后你会不会记得，曾经有一个人很努力的珍惜过你。——失望是一天天积累的，离开是很长的决定…
        每次失望一次，我就少做一件爱你的事，直到最后备注改成全名、取消特别关注、上线不主动找你、收起你送的东西、删掉你所有的照片、再也不偷偷看你的时候，就是该说再见的时候了。多年后你会不会记得，曾经有一个人很努力的珍惜过你。——失望是一天天积累的，离开是很长的决定…
        每次失望一次，我就少做一件爱你的事，直到最后备注改成全名、取消特别关注、上线不主动找你、收起你送的东西、删掉你所有的照片、再也不偷偷看你的时候，就是该说再见的时候了。多年后你会不会记得，曾经有一个人很努力的珍惜过你。——失望是一天天积累的，离开是很长的决定…
      </div>
    </vue-custom-scrollbar>
  </div>
</template>

<script>
import vueCustomScrollbar from "vue-custom-scrollbar";
import "vue-custom-scrollbar/dist/vueScrollbar.css";
export default {
  components: {
    vueCustomScrollbar,
  },
};
</script>
<style lang='scss' scoped>
.test {
  position: absolute;
  top: 10%;
  left: 10%;
  width: 50%;
  height: 50%;
}
.scrollComment {
  margin: auto;
  width: 80%;
  height: 80%;
}
</style>